VOWELS = 'aeiouyаеёиоуыэюяіє'      #глобальна змінна (голосні)
word = input('Введь Вашу фразу: ') #вихідне слово (вводиться)
new_word = ''                      #лновлене слово
for item in word:                  #перебираєм літери в вихідному слові  \
    if item in VOWELS:             #і перевіряєм чи вони входять до глобальної змінної (голосні)                   
        new_word += item.upper()   #якщо літера голосна - додаєм її до оновленого слова, але вже в верхньому регістрі\
        continue                   #і продовжуєм перебір
    else:          
        new_word += item           #інакше, якщо літера не голосна, - просто додаєм її до оновленого слова
print(new_word)                    #друкуєм оновлене слово після попередніх операцій

        

